
/*Перечисление(enum) — это пользовательский тип данных, который состоит из набора именованных целочисленных констант.
Он нужен для того, чтобы заменять абстрактные числа понятными словами.

Обычный enum (Unscoped):
1. Константы в окружающей области видимости.
2. Автоматически превращается в int. 
3. Нельзя создать два enum с одинаковыми именами констант в одной области.	

enum class (Scoped)
1. Константы доступны только через двоеточие : Enum Name::Constant.
2. Не приводится к числам автоматически(требуется static_cast).
3. Константы изолированы, имена могут повторяться в разных перечислениях.

Использование перечислений вместо «магических чисел»(случайных цифр прямо в коде вроде if (status == 3)) дает важные преимущества :
• Самодокументируемый код
• Надежность при изменениях
• Контроль со стороны компилятора

Если не указывать значения вручную, компилятор присваивает первому элементу 0, второму 1, третьему 2 и так далее :

2. Как задать свои числовые значения
Вручную сопоставить константам любые числа.Если задать значение только первому элементу, остальные продолжат увеличиваться от него на единицу

3. Как получить число из enum class
Чтобы извлечь его числовое значение, нужно использовать явное приведение типов — static_cast*/
